package com.banking.cards.constants;

public class TestCardNumbers {
        public static String[] testNumbers = {
                // Visa (должны проходить)
                "4111 1111 1111 1111",  // 16 цифр
                "4012 8888 8888 1881",  // 16 цифр
                "4222 2222 2222 2",     // 13 цифр

                // MasterCard
                "5555 5555 5555 4444",
                "5105 1051 0510 5100",

                // American Express
                "3782 8224 6310 005",
                "3714 4963 5398 431",

                // Discover
                "6011 1111 1111 1117",

                // С пробелами и дефисами
                "4111-1111-1111-1111",
                "4111 1111-1111 1111",
                "4111111111111111"  // без пробелов
        };
}